blogger/app/views/articles/show.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."article_id" = ?  [["article_id", 2]]
---
<%= link_to "delete", article_path(@article), method: :delete, data: {confirm: "really delete this article?"} %>
<h3>Comments (<%= @article.comments.size %>)</h3>