blogger/app/controllers/articles_controller.rb

	def destroy
		@article = Article.find(params[:id]).destroy
---
DELETE FROM "articles" WHERE "articles"."id" = ?  [["id", 6]]
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]